packages/reservation-service/app/controllers/reservations_controller.rb

  def create
    reservation = Reservation.new(create_reservation_params)
    if reservation.save!
---
INSERT INTO "reservations" ("location_id", "user_id", "coach_id", "duration", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["location_id", 2], ["user_id", 2], ["coach_id", 2], ["duration", 222], ["size", 1], ["created_at", "2020-08-31 00:08:04.599888"], ["updated_at", "2020-08-31 00:08:04.599888"]]