user-service/app/controllers/tournaments_controller.rb

  def create
    url = Rails.application.config.tournament_service_host + '/tournaments'
    reroute(url, :post, body: { user_id: current_user.id, org_id: current_user.orgs.first })
---
SELECT  "orgs".* FROM "orgs" INNER JOIN "orgs_users" ON "orgs"."id" = "orgs_users"."org_id" WHERE "orgs_users"."user_id" = ? ORDER BY "orgs"."id" ASC LIMIT ?  [["user_id", 7], ["LIMIT", 1]]

  def add_players
    url = Rails.application.config.tournament_service_host + "/tournaments/#{params[:id]}/players"

    players = Player.find(params[:player_ids]).map do |player|
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]