user-service/app/controllers/users_controller.rb

  def register
    user = User.new(create_user_params)
    user.roles_users.new(role_id: Role.player.id)

    if user.save
---
INSERT INTO "roles_users" ("user_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["role_id", 1], ["created_at", "2020-11-23 02:42:40.207543"], ["updated_at", "2020-11-23 02:42:40.207543"]]
INSERT INTO "users" ("email", "name", "is_enabled", "password_digest") VALUES (?, ?, ?, ?)  [["email", "string@gmail.com"], ["name", "string"], ["is_enabled", "t"], ["password_digest", "$2a$12$ODfJD.905IkUZCUUaTUGe.sAKVBvjyC4n61WIGWXb.XSJq9.tn6oa"]]

  def soft_register
    fake_email = generate_fake_email(
      [
        create_user_soft_params[:name],
        create_user_soft_params[:rating]
      ]
    )
    user = User.new(create_user_soft_params.merge(email: fake_email, password: fake_email, password_confirmation:
      fake_email))
    user.roles_users.new(role_id: Role.player.id)
    user.is_enabled = false

    if user.save
---
INSERT INTO "roles_users" ("user_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["role_id", 1], ["created_at", "2020-12-25 19:22:53.070167"], ["updated_at", "2020-12-25 19:22:53.070167"]]
INSERT INTO "users" ("email", "name", "password_digest", "rating", "usattid") VALUES (?, ?, ?, ?, ?)  [["email", "ErielMa2222@gmail.com"], ["name", "Eriel Ma"], ["password_digest", "$2a$12$VqxVW7yXC253bOL7DynHe.rpbPtgIdjtLEFNOmQzE/vIvlqB.2n72"], ["rating", 2222], ["usattid", "D1141512"]]

  def index_players
    players = Player.all
---
SELECT "players".* FROM "players"

  def show_tournament_data
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def edit
    user = User.find_by_id(edit_user_params[:id])

    if edit_user_params.keys.count <= 1
      # params of size 1 only contains the user id, no useful information to update
      render json: { success: false, message: 'No fields to update' }, status: :unprocessable_entity
    elsif user.nil?
      render json: { success: false, message: 'User does not exist' }, status: 404
    elsif user.update(edit_user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ? WHERE "users"."id" = ?  [["name", "updated jon"], ["id", 2]]

  def add_role
    user = User.find(params[:id])
    org_id = params[:org_id]
    role = Role.find_by(name: params[:role])

    role_user = user.roles_users.find_by(org_id: org_id, role_id: role.id)
    RolesUsers.create!(user_id: user.id, org_id: org_id, role_id: role.id) if role_user.nil?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "player"], ["LIMIT", 1]]
SELECT  "roles_users".* FROM "roles_users" WHERE "roles_users"."user_id" = ? AND "roles_users"."org_id" = ? AND "roles_users"."role_id" = ? LIMIT ?  [["user_id", 2], ["org_id", 1], ["role_id", 1], ["LIMIT", 1]]
INSERT INTO "roles_users" ("user_id", "role_id", "created_at", "updated_at", "org_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["role_id", 1], ["created_at", "2020-08-16 23:28:44.689774"], ["updated_at", "2020-08-16 23:28:44.689774"], ["org_id", 1]]

  def remove_role
    user = User.find(params[:id])
    org_id = params[:org_id]
    role = Role.find_by(name: params[:role])
    user.roles_users.find_by(org_id: org_id, role_id: role.id)&.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "player"], ["LIMIT", 1]]
DELETE FROM "roles_users" WHERE "roles_users"."id" = ?  [["id", 2]]
SELECT  "roles_users".* FROM "roles_users" WHERE "roles_users"."user_id" = ? AND "roles_users"."org_id" = ? AND "roles_users"."role_id" = ? LIMIT ?  [["user_id", 2], ["org_id", 1], ["role_id", 1], ["LIMIT", 1]]