packages/org-service/app/controllers/org_controller.rb

INSERT INTO "orgs" ("name", "created_at", "updated_at", "is_verified", "is_enabled") VALUES (?, ?, ?, ?, ?)  [["name", "New Test Org Name"], ["created_at", "2020-08-15 22:57:16.425738"], ["updated_at", "2020-08-15 22:57:16.425738"], ["is_verified", nil], ["is_enabled", nil]]
INSERT INTO "orgs_users" ("org_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["org_id", 2], ["user_id", 1], ["created_at", "2020-08-15 22:47:26.377262"], ["updated_at", "2020-08-15 22:47:26.377262"]]
---
  def create
    org = Org.create(org_create_params)
    org.orgs_users.create!(user_id: params[:user_id])

UPDATE "orgs" SET "id" = ?, "is_verified" = ?, "name" = ?, "updated_at" = ? WHERE "orgs"."id" = ?  [["id", 10], ["is_verified", "t"], ["name", "New Test Org Name"], ["updated_at", "2020-08-16 00:07:18.026876"], ["id", 1]]
---
  def update
    Org.update(params[:id], update_org_params)

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orgs_users" ("org_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["org_id", 1], ["user_id", 1], ["created_at", "2020-08-16 00:15:35.958640"], ["updated_at", "2020-08-16 00:15:35.958640"]]
---
  def add_user
    org = Org.find(params[:id])
    link = org.orgs_users.create(user_id: params[:user_id])

SELECT  "orgs_users".* FROM "orgs_users" WHERE "orgs_users"."org_id" = ? AND "orgs_users"."user_id" = ? ORDER BY "orgs_users"."id" DESC LIMIT ?  [["org_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def remove_user
    link = OrgsUser.where(org_id: params[:id], user_id: params[:user_id]).last

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "addresses" ("org_id", "addr_1", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["org_id", 1], ["addr_1", "123 Lane 4th st"], ["city", "Bellevue"], ["state", "WA"], ["zip", "99999"], ["created_at", "2020-08-16 00:27:38.524467"], ["updated_at", "2020-08-16 00:27:38.524467"]]
---
  def add_address
    org = Org.find(params[:id])
    address = org.addresses.create!(address_create_params)

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."org_id" = ?  [["org_id", 1]]
---
  def all_addresses
    resp = Org.find(params[:id]).addresses.map(&:attributes)