tournament-service/app/controllers/groups_controller.rb

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def find_match
    match = Match.find(params[:id])

SELECT  "match_sets".* FROM "match_sets" WHERE "match_sets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "match_sets" SET "player1_score" = $1, "player2_score" = $2, "updated_at" = $3 WHERE "match_sets"."id" = $4  [["player1_score", 99], ["player2_score", 99], ["updated_at", "2021-04-03 00:31:06.097174"], ["id", 1]]
INSERT INTO "match_sets" ("player1_score", "player2_score", "created_at", "updated_at", "match_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player1_score", 22], ["player2_score", 22], ["created_at", "2021-04-03 00:33:14.139387"], ["updated_at", "2021-04-03 00:33:14.139387"], ["match_id", 7]]
INSERT INTO "matches" ("best_of", "player1_id", "player2_id", "created_at", "updated_at", "round_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["best_of", 5], ["player1_id", 80], ["player2_id", 123], ["created_at", "2021-04-05 00:30:54.621569"], ["updated_at", "2021-04-05 00:30:54.621569"], ["round_id", 9]]
INSERT INTO "rounds" ("playoff_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["playoff_id", 8], ["created_at", "2021-04-05 00:30:54.610228"], ["updated_at", "2021-04-05 00:30:54.610228"]]
---
  def update_match
    match = Match.find(params[:id])
    params[:sets].each do |set|
      score1 = set['player1_score'].nil? || set['player1_score'].empty? ? 0 : set['player1_score']
      score2 = set['player2_score'].nil? || set['player2_score'].empty? ? 0 : set['player2_score']
      # Update existing sets
      if set['id'] && !set['id'].nil? && !set['id'].empty?
        MatchSet.find(set['id']).update!(
          player1_score: score1,
          player2_score: score2
        )
        next
      end

      # Create new Sets
      match.match_sets.create!(
        player1_score: score1,
        player2_score: score2
      )
    end
    # If match belongs to a playoff round, update playoff
    match.round&.playoff&.create_next_round