tournament-service/app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "matches" ("best_of", "player1_id", "player2_id", "created_at", "updated_at", "group_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["best_of", 5], ["player1_id", 2], ["player2_id", 3], ["created_at", "2021-01-10 16:28:27.872630"], ["updated_at", "2021-01-10 16:28:27.872630"], ["group_id", 4]]
---
  def find_match
    group = Group.find(params[:id])
    p1 = +params[:player1].to_i
    p2 = +params[:player2].to_i
    should_create = params[:should_create] == 'true'
    match = group.matches.find do |matches|
      [matches.player1_id, matches.player2_id].include? p1 and
        [matches.player1_id, matches.player2_id].include? p2
    end

    match = group.matches.create!(best_of: 5, player1_id: p1, player2_id: p2) if match.nil? && should_create

SELECT "match_sets".* FROM "match_sets" WHERE "match_sets"."match_id" = $1  [["match_id", 11]]
SELECT COUNT(*) FROM "match_sets" WHERE "match_sets"."match_id" = $1  [["match_id", 14]]
INSERT INTO "match_sets" ("player1_id", "player1_score", "player2_id", "player2_score", "created_at", "updated_at", "match_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["player1_id", 1], ["player1_score", 11], ["player2_id", 3], ["player2_score", 7], ["created_at", "2021-01-10 17:05:50.767318"], ["updated_at", "2021-01-10 17:05:50.767318"], ["match_id", 11]]
---
  def create_set
    group = Group.find(params[:id])
    p1 = params[:player1].to_i
    p1_score = params[:player1_score].to_i
    p2 = params[:player2].to_i
    p2_score = params[:player2_score].to_i

    match = group.matches.find do |matches|
      [matches.player1_id, matches.player2_id].include? p1 and
        [matches.player1_id, matches.player2_id].include? p2
    end

    if match.is_over?
      render json: { error: "Cannot add set to match {#{match.id}} that has already finished. Winner #{match.winner}" },
             status: :expectation_failed
      return
    end

    if match.match_sets.count >= match.best_of
      render json: { error: 'All sets for this match already created. Did you mean to update an existing one?' },
             status: :expectation_failed
      return
    end

    if match.nil?
      render json: { error: 'Match does not exist', player1: p1, player2: p2 }, status: :not_found
      return
    end

    set = match.match_sets.create!(player1_id: p1, player1_score: p1_score, player2_id: p2, player2_score: p2_score)