tournament-service/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    # return an array of tournaments [{}, {}]
    render json: Tournament.all, status: :ok

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def show
    render json: Tournament.find(params[:id]), status: :ok

INSERT INTO "tournaments" ("scheduled_at", "stage", "creator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["scheduled_at", "2020-12-26"], ["stage", 0], ["creator", "{\"user_id\":\"7\",\"org_id\":\"\"}"], ["created_at", "2020-12-26 00:10:18.735147"], ["updated_at", "2020-12-26 00:10:18.735147"]]
---
  def create
    tour = Tournament.new(
      creator: create_tournament_params,
      stage: Tournament.stages[:registration],
      scheduled_at: Date.current
    )
    if tour.save

DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 44]]
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def delete
    Tournament.find(params[:id]).destroy

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def add_players
    tour = Tournament.find(add_player_params[:id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "tournaments" SET "players" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3
---
  def remove_players
    tour = Tournament.find(params[:id])
    params[:player_ids].each do |id|
      tour.remove_player id.to_i
    end
    tour.save!

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
---
  def create_groups
    tour = Tournament.find(params[:id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = $1  [["tournament_id", 47]]
SELECT "matches".* FROM "matches" WHERE "matches"."group_id" = $1  [["group_id", 3]]
SELECT COUNT(*) FROM "groups" WHERE "groups"."tournament_id" = $1  [["tournament_id", 47]]
SELECT COUNT(*) FROM "matches" WHERE "matches"."group_id" = $1  [["group_id", 3]]
INSERT INTO "matches" ("best_of", "player1_id", "player2_id", "created_at", "updated_at", "playoff_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["best_of", 5], ["player1_id", -1], ["player2_id", -1], ["created_at", "2021-01-17 20:42:53.934063"], ["updated_at", "2021-01-17 20:42:53.934063"], ["playoff_id", 8]]
INSERT INTO "playoffs" ("tournament_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tournament_id", 47], ["created_at", "2021-01-17 20:33:43.236606"], ["updated_at", "2021-01-17 20:33:43.236606"]]
---
  def create_playoffs
    tour = Tournament.find(params[:id])
    unless tour.classification_over?
      render json: {
        error: 'Classification stage is not over. Did all matches finished?',
        player_count: tour.players.count,
        group_count: tour.groups.count,
        expected_matches_count: tour.expected_total_matches,
        matches_created_count: tour.groups.map { |gro| gro.matches.count }.reduce(:+),
        matches_in_progress_count: tour.groups.map(&:total_matches_in_progress).reduce(:+),
        matches_over_count: tour.groups.map(&:total_matches_over).reduce(:+)
      }, status: :expectation_failed
      return
    end
    tour.create_playoffs!

SELECT  "playoffs".* FROM "playoffs" WHERE "playoffs"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
SELECT  "rounds".* FROM "rounds" WHERE "rounds"."playoff_id" = $1 ORDER BY "rounds"."id" DESC LIMIT $2  [["playoff_id", 52], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."round_id" = $1  [["round_id", 15]]
---
  def update_playoffs_match
    playoff = Playoff.find(params[:id])
    playoff.update_match(
      params[:player1],
      params[:player1_score],
      params[:player2],
      params[:player2_score]
    )
    playoff.create_next_round if playoff.rounds.last.over? && !playoff.rounds.last.final?