tournament-service/app/controllers/tournaments_controller.rb

  def add_player
    tour = Tournament.find(add_player_params[:id])
    tour.players = [] if tour.players.nil?
    new_player = {
      id: add_player_params[:player_id],
      name: add_player_params[:name],
      rating: add_player_params[:rating]
    }
    begin
      tour.add_player new_player
      tour.save!
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "tournaments" SET "players" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3  [["players", "[{\"id\":1,\"name\":\"Terst Play\",\"rating\":1000}]"], ["updated_at", "2020-12-28 21:34:11.669812"], ["id", 46]]

  def remove_player
    tour = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]