reservation-service/app/controllers/reservations_controller.rb

  def create
    reservation = Reservation.new(create_reservation_params)
    if reservation.save!
---
INSERT INTO "reservations" ("start_timestamp", "kind", "created_at", "updated_at", "host", "recipient", "note") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["start_timestamp", 1619583548], ["kind", 0], ["created_at", "2021-04-28 04:21:02.863102"], ["updated_at", "2021-04-28 04:21:02.863102"], ["host", 1], ["recipient", 2], ["note", "Hey Yo"]]

  def update
    reservation = Reservation.find_by_id(params[:id])
    if reservation.nil?
      render_not_found(Reservation.class.name, params[:id])
    elsif reservation.update!(update_reservation_params)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "note" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["note", "A LONGER NOTE FOR RECOGNITION"], ["updated_at", "2021-04-28 17:06:13.868437"], ["id", 3]]

  def delete
    reservation = Reservation.find_by_id(params[:id])
    reservation&.destroy
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 2]]

  def show
    reservation = Reservation.find_by_id(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]