reservation-service/app/controllers/schedules_controller.rb

  def create
    # If exists, update it
    existing_schedule = Schedule.find_by_org_id(create_schedule_params[:org_id])
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."org_id" = $1 LIMIT $2  [["org_id", 0], ["LIMIT", 1]]