packages/user-service/app/controllers/org_controller.rb

INSERT INTO "orgs" ("name", "is_verified", "is_enabled", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Test Org Name"], ["is_verified", nil], ["is_enabled", nil], ["created_at", "2020-08-16 23:36:59.648586"], ["updated_at", "2020-08-16 23:36:59.648586"]]
INSERT INTO "orgs_users" ("user_id", "org_id") VALUES (?, ?)  [["user_id", 1], ["org_id", 2]]
---
  def create
    org = current_user.orgs.create(org_create_params)

UPDATE "orgs" SET "is_verified" = ?, "name" = ?, "updated_at" = ? WHERE "orgs"."id" = ?  [["is_verified", "t"], ["name", "New Test Org Name"], ["updated_at", "2020-08-16 23:36:59.759000"], ["id", 1]]
---
  def update
    Org.update(params[:id], update_org_params)

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def add_user
    org = Org.find(params[:id])
    user = User.find(params[:user_id])

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "orgs_users" WHERE "orgs_users"."org_id" = ? AND "orgs_users"."user_id" = 1  [["org_id", 1]]
---
  def remove_user
    org = Org.find(params[:id])
    user = User.find(params[:user_id])
    org.users.delete(user)

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "addresses" ("org_id", "addr_1", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["org_id", 1], ["addr_1", "123 Lane 4th st"], ["city", "Bellevue"], ["state", "WA"], ["zip", "99999"], ["created_at", "2020-08-16 23:37:00.005124"], ["updated_at", "2020-08-16 23:37:00.005124"]]
---
  def add_address
    org = Org.find(params[:id])
    address = org.addresses.create!(address_create_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def all_users
    org = Org.find(params[:id])
    users = org.users.map(&:attributes)

SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."org_id" = ?  [["org_id", 1]]
---
  def all_addresses
    resp = Org.find(params[:id]).addresses.map(&:attributes)