packages/user-service/app/controllers/users_controller.rb

  def register
    user = User.new(create_user_params)
    user.roles_users.new(role_id: Role.player.id)

    if user.save
---
INSERT INTO "roles_users" ("user_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["role_id", 1], ["created_at", "2020-08-16 23:28:44.388404"], ["updated_at", "2020-08-16 23:28:44.388404"]]
INSERT INTO "users" ("email", "name", "is_enabled", "password_digest") VALUES (?, ?, ?, ?)  [["email", "string@gmail.com"], ["name", "string"], ["is_enabled", "t"], ["password_digest", "$2a$12$ODfJD.905IkUZCUUaTUGe.sAKVBvjyC4n61WIGWXb.XSJq9.tn6oa"]]

  def edit
    user = User.find_by_id(edit_user_params[:id])

    if edit_user_params.keys.count <= 1
      # params of size 1 only contains the user id, no useful information to update
      render json: { success: false, message: 'No fields to update' }, status: :unprocessable_entity
    elsif user.nil?
      render json: { success: false, message: 'User does not exist' }, status: 404
    elsif user.update(edit_user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ? WHERE "users"."id" = ?  [["name", "updated jon"], ["id", 2]]

  def add_role
    user = User.find(params[:id])
    org_id = params[:org_id]
    role = Role.find_by(name: params[:role])

    role_user = user.roles_users.find_by(org_id: org_id, role_id: role.id)
    RolesUsers.create!(user_id: user.id, org_id: org_id, role_id: role.id) if role_user.nil?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "player"], ["LIMIT", 1]]
SELECT  "roles_users".* FROM "roles_users" WHERE "roles_users"."user_id" = ? AND "roles_users"."org_id" = ? AND "roles_users"."role_id" = ? LIMIT ?  [["user_id", 2], ["org_id", 1], ["role_id", 1], ["LIMIT", 1]]
INSERT INTO "roles_users" ("user_id", "role_id", "created_at", "updated_at", "org_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["role_id", 1], ["created_at", "2020-08-16 23:28:44.689774"], ["updated_at", "2020-08-16 23:28:44.689774"], ["org_id", 1]]

  def remove_role
    user = User.find(params[:id])
    org_id = params[:org_id]
    role = Role.find_by(name: params[:role])
    user.roles_users.find_by(org_id: org_id, role_id: role.id)&.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "player"], ["LIMIT", 1]]
DELETE FROM "roles_users" WHERE "roles_users"."id" = ?  [["id", 2]]
SELECT  "roles_users".* FROM "roles_users" WHERE "roles_users"."user_id" = ? AND "roles_users"."org_id" = ? AND "roles_users"."role_id" = ? LIMIT ?  [["user_id", 2], ["org_id", 1], ["role_id", 1], ["LIMIT", 1]]